app/controllers/comments_controller.rb

  def index
    @comment = Comment.new(:commentable_type => params[:commentable_type],
                           :commentable_id => params[:commentable_id])
    @comments = Comment.find_all_by_commentable_type_and_commentable_id(params[:commentable_type],
                                                                        params[:commentable_id],
                                                                        :order => "id asc", :include => [:user])
---
SELECT * FROM "comments" WHERE ("comments"."commentable_type" = 'Post' AND "comments"."commentable_id" = 1) ORDER BY id desc, created_at ASC

  def create
		if not @current_user
			notice_error("对不起，登陆后才可发表评论。")
			respond_to do |format|
				format.html { require_user }
				format.js {
					render :layout => false
			 	}
			end
			return false
		end

    @comment = Comment.new(params[:comment])
    @comment.user_id = @current_user.id
    if @comment.save
---
INSERT INTO "comments" ("comment", "created_at", "title", "commentable_type", "commentable_id", "updated_at", "user_id") VALUES('asdggggggg', '2010-06-03 06:37:55', '', 'Post', 8, '2010-06-03 06:37:55', 2)