app/controllers/posts_controller.rb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags".id = "taggings".tag_id WHERE (("taggings".taggable_id = 2) AND ("taggings".taggable_type = 'Post') AND ((taggings.tagger_id IS NULL AND taggings.context = 'tags')))
SELECT * FROM "posts" ORDER BY id desc LIMIT 2 OFFSET 0
SELECT count(*) AS count_all FROM "posts"
---
  def index
    @posts = Post.paginate(:page => params[:page], :per_page => Setting.per_page, :order => "id desc", :include => [:tags, :user])

SELECT * FROM "posts" WHERE ("posts"."id" = 3 AND ("posts".user_id = 1))
---
  def edit
    @post = @current_user.posts.find(params[:id])

INSERT INTO "posts" ("created_at", "body", "updated_at", "user_id", "comments_count") VALUES('2010-06-02 14:53:29', '几年前趁女盆友家里没人屁颠屁颠的跑去她家里xxoo了（你们懂的）。正高（防止河蟹）潮迭起突然一阵钥匙响声，太阳啊，岳母大人竟然突然回家了，当时高二，被发现绝对是赤裸裸的杯具了（床单里面的东西，你们也懂的） 那脚步声直逼女友房间，当时那石更的东西马上就车欠了（大家都懂的）。躲床底躲柜子是来不及了，灵鸡一动的我发现女友床边缘处是她妹妹的床，高出有一小小截，对！只有一小小截！胆大心细的我迅速做出判断～把衣服裤子内裤往床下一丢拿床单一盖，借着那凸起床边做掩护，形成一种我就是床单床单就是我的迷幻错觉… 只听见岳母又是家常又是饭后的完全没有走的意思，我当时已经连出来认错的觉悟都有了（穿好衣服的情况下）…还好岳母大人最后聊了几分钟就去洗澡了。见到光明的我从床底下抽出起衣服不管正的反的内裤袜子也没穿塞牛仔裤里套好嗖一声箭似的ws的逃走了～ 回家的公交车上一个劲的赞叹自己命大rp好～脑残的从口袋里拿出一布状物体擦刚才的冷汗～觉得味道有点不对的时候发现一大妈眼神不cj的一个劲盯着…太阳啊！原来我手上的是我那hll的蓝色间隔条纹内裤！我45度朝天，顿时内牛满面… 手鸡党不容易，大哥让过了吧。', '2010-06-02 14:53:29', 1, 0)
---
  def create
    @post = @current_user.posts.build(params[:post])

    respond_to do |format|
      if @post.save